Revit 2027 API
Options.IncludeNonVisibleObjects Property
Whether to extract element geometry objects not set as Visible. The default is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeNonVisibleObjects { get; set; }
Public Property IncludeNonVisibleObjects As Boolean
	Get
	Set
public:
property bool IncludeNonVisibleObjects {
	bool get ();
	void set (bool value);
}
member IncludeNonVisibleObjects : bool with get, set
Property Value
Boolean
See Also
Reference
Options Class
Autodesk.Revit.DB Namespace